<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"a5946c87d901615c04df94f82bf7a67f7762b92bf8ef9f7d50f345449cf65b96","plan_job_ref":"Job Tests for PRs #208 at https://github.com/GSA-TTS/FAC/actions/runs/4918386448","plan_hash":"113408ae30d90286c46d61756bf5c6be3b2c35783e1525a57f8d0a2df46bce2f","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 3 to add, 3 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dev.cloudfoundry_app.postgrest will be updated in-place
  ~ resource "cloudfoundry_app" "postgrest" {
        id                              = "5de6f04c-52e0-400f-961a-16243b1c7c9a"
        name                            = "postgrest"
        # (15 unchanged attributes hidden)

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.dev.cloudfoundry_app.swagger will be updated in-place
  ~ resource "cloudfoundry_app" "swagger" {
      ~ docker_image                    = "swaggerapi/swagger-ui:latest" -> "swaggerapi/swagger-ui"
      ~ environment                     = (sensitive value)
        id                              = "7cea1ba8-754e-4ea6-8e98-ddaf0b4356e1"
      ~ id_bg                           = "************************************" -> (known after apply)
      ~ name                            = "swagger-venerable" -> "swagger"
      ~ stopped                         = true -> false
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev.cloudfoundry_network_policy.swagger_to_postgrest will be created
  + resource "cloudfoundry_network_policy" "swagger_to_postgrest" {
      + id = (known after apply)

      + policy {
          + destination_app = "5de6f04c-52e0-400f-961a-16243b1c7c9a"
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = (known after apply)
        }
    }

  # module.dev.cloudfoundry_route.postgrest-private will be created
  + resource "cloudfoundry_route" "postgrest-private" {
      + domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
      + endpoint = (known after apply)
      + hostname = "fac-dev-postgrest"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
    }

  # module.dev.cloudfoundry_user_provided_service.credentials will be created
  + resource "cloudfoundry_user_provided_service" "credentials" {
      + credentials = (sensitive value)
      + id          = (known after apply)
      + name        = "newrelic-creds"
      + space       = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
    }

  # module.dev.module.egress-proxy.cloudfoundry_network_policy.client_routing["swagger"] will be updated in-place
  ~ resource "cloudfoundry_network_policy" "client_routing" {
        id = "c5cd8dfc-8d18-e298-0a9b-4f001f14c5d9"

      + policy {
          + destination_app = "7e9f7032-0348-46c2-8126-252ad00c7d66"
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "39b80fb5-d3f7-47c2-9ac4-b339bcb5b939"
        }
    }

Plan: 3 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Tests for PRs #208](https://github.com/GSA-TTS/FAC/actions/runs/4918386448)